{
  "id": "smart-payment",
  "title": "Smart Payment: EasyCard & iPASS",
  "tag": "ESSENTIALS",
  "heroImage": "/image/transport/payment_banner.jpg",
  "heroImageCredit": "<a href='https://commons.wikimedia.org/wiki/File:TPASS%E5%9F%BA%E5%8C%97%E5%8C%97%E6%A1%83%E9%83%BD%E6%9C%83%E9%80%9A%E6%AD%A3%E9%9D%A2_20230701.jpg' target='_blank'>Mafalda4144</a>, <a href='https://creativecommons.org/licenses/by-sa/4.0' target='_blank'>CC BY-SA 4.0</a>, via Wikimedia Commons",
  "updatedAt": "2026/01/06",
  "intro": "The EasyCard and iPASS are indispensable tools for traveling in Taiwan. They are contactless smart cards that can be used for MRT, buses, trains, YouBike, and even convenience stores. Buying one is the first thing you should do upon arrival!",
  "sections": [
    {
      "id": "where-to-buy",
      "heading": "How to Buy & Top Up",
      "content": "<p>You can purchase these cards at any <strong>Convenience Store</strong> (7-Eleven, FamilyMart, OK, Hi-Life) or MRT station service counters. They are sold as standard cards or as cute keychains (3D shapes). Just look for the rack near the cashier!</p><p><strong>Price:</strong> A card usually costs NT$100 (non-refundable deposit). You then need to top it up with cash.</p><p><strong>Top Up:</strong> You can recharge at any MRT station machine or directly at convenience stores.</p><p><strong>Mobile App:</strong> Both EasyCard (EasyWallet) and iPASS (iPASS MONEY) offer apps that can link to credit cards for mobile payments, adding extra convenience.</p>",
      "links": [
        {"text": "EasyCard Official Website", "url": "https://www.easycard.com.tw/en/"}
      ],
      "tip": "Buy your card at the airport convenience store immediately after landing. It saves time!"
    },
    {
      "id": "usage-scope",
      "heading": "Where Can I Use It?",
      "content": "<p><strong>MRT (Subway):</strong> Accepted in Taipei, Taoyuan, Taichung, and Kaohsiung. While single-journey tokens are available, using an IC card is standard.</p><p><strong>Buses:</strong> Almost all city buses accept card tapping (both front and rear doors). Some buses do not even accept cash/coins anymore.</p><p><strong>Shopping:</strong> You can pay for snacks and drinks at major convenience stores using your card balance.</p>",
      "links": [
        {"text": "Taipei Metro Ticketing Info", "url": "https://english.metro.taipei/cp.aspx?n=BECC2E7AC426F659"}
      ]
    },
    {
      "id": "important-train-rules",
      "heading": "⚠️ IMPORTANT: Train Rules (TRA & HSR)",
      "content": "<p>While IC cards are convenient, they cannot be used for everything. Please note the following exceptions:</p><h3>1. Taiwan Railways (TRA)</h3><p>You <strong>CAN</strong> use EasyCard/iPASS for most local trains and standard express trains (standing ticket). You just tap in at the gate.</p><p style='color: #d9534f; font-weight: bold; background: #fff0f0; padding: 10px; border-left: 4px solid #d9534f;'>HOWEVER: For specific express trains like the Puyuma Express (普悠瑪) or Taroko Express (太魯閣), you MUST buy a reserved seat ticket. You cannot use an IC card to enter.</p><a href='/transport/tra-guide' class='feed-btn' style='display:inline-block; margin:10px 0; text-decoration:none;'>👉 Read our TRA Train Guide for details</a><h3>2. Taiwan High Speed Rail (HSR)</h3><p>Tourists generally <strong>CANNOT</strong> use a standard EasyCard for the HSR (unless it is a specific co-branded credit card). You must buy a physical ticket or e-ticket.</p>",
      "tip": "Rule of Thumb: For MRT & Buses, tap your card. For long-distance trains, check if you need a reserved ticket first."
    }
  ]
}